[
  {
    "title": "Designänderung des Blog Editors",
    "date": "17. Juli 2025",
    "rssDate": "Thu, 17 Jul 2025 09:52:00 GMT",
    "author": "n-km",
    "category": "Statusupdate",
    "image": "",
    "text": "Das Design des Blog Editors hat sich geändert. Das Benutzererlebnis hat sich dadurch verbessert. Jedoch sind die Farben monotom - also grau. Der Editor kann gerne ausprobiert werden unter folgendem Link: <a href=\"https://n-km.github.io/blog/edit-v\">https://n-km.github.io/blog/edit-v.html</a>. Wie gesagt: Falls Verbesserungsvorschläge bestehen: Gerne unter dem Tab \"Kontakt\" an die E-Mail Adresse melden. "
  },
  {
    "title": "Icon Hinzugefügt",
    "date": "16. Juli 2025",
    "rssDate": "Wed, 16 Jul 2025 11:37:00 GMT",
    "author": "n-km",
    "category": "Statusupdate",
    "image": "",
    "text": "Vorübergehend ist jetzt auch ein Icon der Webseite verfügbar. Dieses wird sich jedoch in kürze ändern, da dies aus dem Internet entnommen wurde. Der jeweilige Link ist in der ./images/LINKS.MD - Datei enthalten. Wie gesagt, es ist nur temporär. Die Produktion des eigenen Icons wird demnächst anstehen. \nMomentan kommen viele Statusupdates rein. Im Verlaufe der Zeit wird es weniger werden. Momentan befinden wir uns in der Entwicklungsphase, was der Grund dafür ist. Für Verbesserungsvorschläge, sei es das Design oder das Benutzererlebnis, stehen wir jederzeit unter dem Tab \"Kontakt\" zur Verfügung."
  },
  {
    "title": "RSS Uhrzeit hinzugefügt",
    "date": "15. Juli 2025",
    "rssDate": "Tue, 15 Jul 2025 10:18:00 GMT",
    "author": "n-km",
    "category": "Statusupdate",
    "image": "",
    "text": "Es wurde jetzt sowohl im Editor als auch beim RSS die Uhrzeit hinzugefügt.\nDies ermöglicht eine genauere Zeitkontrolle. Es ist nur wichtig, um Ereignisse detaillierter vom Alter zu unterscheiden."
  },
  {
    "title": "Neuer Blog Editor",
    "date": "15. Juli 2025",
    "author": "n-km",
    "category": "Statusupdate",
    "image": "https://n-km.github.io/blog/images/07-15.png",
    "text": "Es steht jetzt ein neuer Editor zur Verfügung, womit man die Beiträge lokal bearbeiten kann. Jedoch benötigt man einen localhost, da es sonst nicht funktioniert. Dazu: im Ordner das Terminal öffnen und folgendes eingeben: \"python3 -m http.server\". Somit sollte ein vollständiger Webserver laufen und es müsste funktionieren. Falls es Fragen gibt, bin ich gerne erreichbar."
  },
  {
    "title": "Statusupdate",
    "date": "09. Juli 2025",
    "author": "n-km",
    "category": "Statusupdate",
    "image": "",
    "text": "Was sind Statusupdates? - Statusupdates sind Updates von dem laufendem Projekt, der Blog-Website hier. Diese Updates erfolgen wöchentlich variabel. Sie enthalten exklusive Informationen u.a. zum Fortschritt."
  },
  {
    "title": "Neuer Dienst: RSS",
    "date": "04. Juli 2025",
    "author": "n-km",
    "category": "Allgemein",
    "image": "",
    "text": "Seit dem 03. Juli 2025 gibt es ein RSS-Feed für diesen Blog. Man kann sagen, dass ein RSS-Feed wie aktuelle Nachrichten sind, die kurz und knapp zu lesen sind. Um diese einzubetten benötigen Sie folgendes: Einen RSS-Reader - Dafür gibt es entweder FreshRSS oder andere RSS-Reader. <br><br> RSS-Feed - Allgemein: <code>https://n-km.github.io/blog/rss.xml</code> <br><br> Viel Spaß beim Lesen!"
  },
  {
    "title": "Mein Portfolio",
    "date": "03. Juli 2025",
    "author": "n-km",
    "category": "Allgemein",
    "image": "",
    "text": "Ich habe ein Portfolio auf GitHub, wo man mehrere Bilder sehen und herunterladen kann. Wenn Sie möchten können Sie gerne mal die Webseite besuchen. Diese Webseite habe ich von Grund auf selbst programmiert. Ich hoffe, es gefällt Ihnen. Wenn überhaupt jemand auf diese Seite gelangt xD. <a href='https://n-km.github.io/insta'>https://n-km.github.io/insta</a>"
  },
  {
    "title": "Biene durch das Vintage-Objektiv",
    "date": "03. Juli 2025",
    "author": "n-km",
    "category": "Insekta",
    "image": "https://live.staticflickr.com/65535/54627969889_590e13ebc1_c.jpg",
    "text": "Hier habe ich mich wieder letztens mit meinem alten Body (Also die Canon EOS 600D) und dem Pentacon 50mm f/1.8, also ein Vintage-Objektiv, ausprobiert. Mit Erfolg: Mir flog eine Biene auf der gelben Blume und ich konnte sie gut manuell fokussieren und aufnehmen. Das Ergebnis: Den Moment mit einem schönem Bokeh und die Biene mit einer guten Auflösung aufgenommen. [<a href='https://flic.kr/p/2rehCeP'>Zum Flickr-Beitrag...</a>]"
  },
  {
    "title": "Gänseblümchen mit dem Tele",
    "date": "23. Juni 2025",
    "author": "n-km",
    "category": "Pflanzen",
    "image": "https://live.staticflickr.com/65535/54608212926_aacc6517a0_c.jpg",
    "text": "An diesem Tag konnte ich mein Teleobjektiv, also das Sony 200-600mm, bei schönem Licht an Pflanzen auch mal ausprobieren. Das Bild besitzt einen schönen Bokeh. An der Schwärfe könnte man nochmal arbeiten, denn nicht alles ist scharf. Dafür muss man dann einfach die Blende etwas mehr schließen. In Zukunft werde ich mich da auf jeden Fall nochmal mehr ausprobieren. Insgesamt finde ich, ist es eine gelungene Aufnahme geworden. [<a href='https://flic.kr/p/2rcxnbw'>Zum Flickr-Beitrag...</a>]"
  },
  {
    "title": "Eine Grille im Gras",
    "date": "22. Juni 2025",
    "author": "n-km",
    "category": "Insekta",
    "image": "https://live.staticflickr.com/65535/54605874838_d16c785f2e_c.jpg",
    "text": "Nach langer Zeit mal wieder meine Sony a6700 mit dem Sony 200-600 rausgeholt und mal probiert ein bisschen näher an den kleinen Tieren ranzukommen. Das heißt: In den Garten und auf den Rasen setzten und warten, bis man etwas sieht. Das kann manchmal ewig dauern, wofür ich keine Geduld habe xD. Aber diesmal ging es relativ schnell. Ich konnte Bienen sehen, die man eh häufig sieht. Das Meiste, was man seltener sieht, sind Tiere, die auf dem Boden leben. Denn die können sich ganz leicht im Gras verstecken. Ich hatte also Glück und konnte eine Grille sehen. Das war echt schön, denn ich habe noch nie zuvor eine Grille fotografieren können, weil ich nie eine gesehen habe. In Zukunft werde ich mich auch mehr auf kleinere Dinge konzentrieren. Das schöne am Fotografieren ist: Du kletterst eine Leiter hoch, die nie endet. [<a href='https://flic.kr/p/2rcko9E'>Zum Flickr-Beitrag...</a>]"
  }
]